---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.Megapascals
source: html/b7905bf0-26fd-1b46-c28c-10f812b39b8e.htm
---
# Autodesk.Revit.DB.UnitTypeId.Megapascals Property

Megapascals.

## Syntax (C#)
```csharp
public static ForgeTypeId Megapascals { get; }
```